Deadline039/STM32-Template/freertos_f429/User/Bsp/Src/dma_uart.c
/**
 * @file    dma_uart.c
 * @author  Deadline039
 * @brief   使用DMA+半满中断+满中断+空闲中断实现高可靠串口数据收发
 * @version 1.1
 * @date    2024-01-18
 * @note    stm32f429串口DMA配置文件
 * @ref     https://github.com/Prry/stm32-uart-dma
 *          https://gitee.com/wei513723/stm32-stable-uart-transmit-receive
 */

#include "bsp.h"
#include "ring_fifo.h"
#include "uart.h"

#include <string.h>

void uart_dmatx_clear_tc_flag(UART_HandleTypeDef *huart);

void uart_dmarx_halfdone_callback(UART_HandleTypeDef *huart);
void uart_dmarx_done_callback(UART_HandleTypeDef *huart);

/**
 * @brief 串口发送缓冲区
 */
typedef struct {
    uint8_t *send_buf;     /*!< 发送数据缓冲区 */
    uint32_t head_ptr;     /*!< 位置指针, 用来控制DMA传输的长度 */
    size_t send_buf_size;  /*!< 缓冲区大小, 避免溢出 */
    __IO uint32_t tc_flag; /*!< 是否发送完成, 0-未完成; 1-完成 */
} uart_tx_buf_t;

/**
 * @brief 串口接收缓冲区
 *
 */
typedef struct {
    ring_fifo_t *rx_fifo; /*!< 接收FIFO */
    uint8_t *rx_fifo_buf; /*!< FIFO数据存储区 */
    uint8_t *recv_buf;    /*!< DMA接收数据缓冲区 */
    uint32_t head_ptr;    /*!< 位置指针, 用来控制半满和溢出 */
} uart_rx_fifo_t;

#if (USART1_ENABLE == 1)

#if (USART1_USE_DMA_TX == 1)
static DMA_HandleTypeDef usart1_dmatx_handle = {
    .Instance = DMA2_Stream7,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_MEMORY_TO_PERIPH,       /* 发送, 内存到外设 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_NORMAL,                      /* 正常模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,     /* 关闭外设地址自增 */
    .Init.Priority = USART1_DMA_TX_PRIORITY /* DMA优先级 */
};
static uart_tx_buf_t usart1_tx_buf;

/**
 * @brief 串口1发送中断句柄
 *
 */
void DMA2_Stream7_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart1_dmatx_handle);
}
#endif /* USART1_USE_DMA_TX == 1 */

#if (USART1_USE_DMA_RX == 1)
static DMA_HandleTypeDef usart1_dmarx_handle = {
    .Instance = DMA2_Stream5,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_PERIPH_TO_MEMORY,       /* 接收, 外设到内存 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_CIRCULAR,                    /* 循环模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,     /* 关闭外设地址自增 */
    .Init.Priority = USART1_DMA_RX_PRIORITY /* DMA优先级 */
};
static uart_rx_fifo_t usart1_rx_fifo;

/**
 * @brief 串口1接收中断句柄
 *
 */
void DMA2_Stream5_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart1_dmarx_handle);
}
#endif /* USART1_USE_DMA_RX == 1 */

#endif /* USART1_ENABLE == 1 */

#if (USART2_ENABLE == 1)

#if (USART2_USE_DMA_TX == 1)
static DMA_HandleTypeDef usart2_dmatx_handle = {
    .Instance = DMA1_Stream6,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_MEMORY_TO_PERIPH,       /* 发送, 内存到外设 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_NORMAL,                      /* 正常模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,     /* 关闭外设地址自增 */
    .Init.Priority = USART2_DMA_TX_PRIORITY /* DMA优先级 */
};
static uart_tx_buf_t usart2_tx_buf;

/**
 * @brief 串口2发送中断句柄
 *
 */
void DMA1_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart2_dmatx_handle);
}
#endif /* USART2_USE_DMA_TX == 1 */

#if (USART2_USE_DMA_RX == 1)
static DMA_HandleTypeDef usart2_dmarx_handle = {
    .Instance = DMA1_Stream5,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_PERIPH_TO_MEMORY,       /* 接收, 外设到内存 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_CIRCULAR,                    /* 循环模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,     /* 关闭外设地址自增 */
    .Init.Priority = USART2_DMA_RX_PRIORITY /* DMA优先级 */
};
static uart_rx_fifo_t usart2_rx_fifo;

/**
 * @brief 串口2接收中断句柄
 *
 */
void DMA1_Stream5_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart2_dmarx_handle);
}
#endif /* USART2_USE_DMA_RX == 1 */

#endif /* USART2_ENABLE == 1 */

#if (USART3_ENABLE == 1)

#if (USART3_USE_DMA_TX == 1)
static DMA_HandleTypeDef usart3_dmatx_handle = {
    .Instance = DMA1_Stream3,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_MEMORY_TO_PERIPH,       /* 发送, 内存到外设 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_NORMAL,                      /* 正常模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,     /* 关闭外设地址自增 */
    .Init.Priority = USART3_DMA_TX_PRIORITY /* DMA优先级 */
};
static uart_tx_buf_t usart3_tx_buf;

/**
 * @brief 串口3发送中断句柄
 *
 */
void DMA1_Stream3_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart3_dmatx_handle);
}
#endif /* USART3_USE_DMA_TX == 1 */

#if (USART3_USE_DMA_RX == 1)
static DMA_HandleTypeDef usart3_dmarx_handle = {
    .Instance = DMA1_Stream1,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_PERIPH_TO_MEMORY,       /* 接收, 外设到内存 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_CIRCULAR,                    /* 循环模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,     /* 关闭外设地址自增 */
    .Init.Priority = USART3_DMA_RX_PRIORITY /* DMA优先级 */
};
static uart_rx_fifo_t usart3_rx_fifo;

/**
 * @brief 串口3接收中断句柄
 *
 */
void DMA1_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart3_dmarx_handle);
}
#endif /* USART3_USE_DMA_RX == 1 */

