Deadline039/STM32-Template/freertos_f429/User/Bsp/Src/dma_uart.c
#endif /* USART3_ENABLE == 1 */

#if (UART4_ENABLE == 1)

#if (UART4_USE_DMA_TX == 1)
static DMA_HandleTypeDef uart4_dmatx_handle = {
    .Instance = DMA1_Stream4,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_MEMORY_TO_PERIPH,       /* 发送, 内存到外设 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_NORMAL,                      /* 正常模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,    /* 关闭外设地址自增 */
    .Init.Priority = UART4_DMA_TX_PRIORITY /* DMA优先级 */
};
static uart_tx_buf_t uart4_tx_buf;

/**
 * @brief 串口4发送中断句柄
 *
 */
void DMA1_Stream4_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart4_dmatx_handle);
}
#endif /* UART4_USE_DMA_TX == 1 */

#if (UART4_USE_DMA_RX == 1)
static DMA_HandleTypeDef uart4_dmarx_handle = {
    .Instance = DMA1_Stream2,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_PERIPH_TO_MEMORY,       /* 接收, 外设到内存 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_CIRCULAR,                    /* 循环模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,    /* 关闭外设地址自增 */
    .Init.Priority = UART4_DMA_RX_PRIORITY /* DMA优先级 */
};
static uart_rx_fifo_t uart4_rx_fifo;

/**
 * @brief 串口4接收中断句柄
 *
 */
void DMA1_Stream2_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart4_dmarx_handle);
}
#endif /* UART4_USE_DMA_RX == 1 */

#endif /* UART4_ENABLE == 1 */

#if (UART5_ENABLE == 1)

#if (UART5_USE_DMA_TX == 1)
static DMA_HandleTypeDef uart5_dmatx_handle = {
    .Instance = DMA1_Stream7,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_MEMORY_TO_PERIPH,       /* 发送, 内存到外设 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_NORMAL,                      /* 正常模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,    /* 关闭外设地址自增 */
    .Init.Priority = UART5_DMA_TX_PRIORITY /* DMA优先级 */
};
static uart_tx_buf_t uart5_tx_buf;

/**
 * @brief 串口5发送中断句柄
 *
 */
void DMA1_Stream7_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart5_dmatx_handle);
}
#endif /* UART5_USE_DMA_TX == 1 */

#if (UART5_USE_DMA_RX == 1)
static DMA_HandleTypeDef uart5_dmarx_handle = {
    .Instance = DMA1_Stream0,
    .Init.Channel = DMA_CHANNEL_4,
    .Init.Direction = DMA_PERIPH_TO_MEMORY,       /* 接收, 外设到内存 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_CIRCULAR,                    /* 循环模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,    /* 关闭外设地址自增 */
    .Init.Priority = UART5_DMA_RX_PRIORITY /* DMA优先级 */
};
static uart_rx_fifo_t uart5_rx_fifo;

/**
 * @brief 串口5接收中断句柄
 *
 */
void DMA1_Stream0_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart5_dmarx_handle);
}
#endif /* UART5_USE_DMA_RX == 1 */

#endif /* UART5_ENABLE == 1 */

#if (USART6_ENABLE == 1)

#if (USART6_USE_DMA_TX == 1)
static DMA_HandleTypeDef usart6_dmatx_handle = {
    .Instance = DMA2_Stream6,
    .Init.Channel = DMA_CHANNEL_5,
    .Init.Direction = DMA_MEMORY_TO_PERIPH,       /* 发送, 内存到外设 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_NORMAL,                      /* 正常模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,     /* 关闭外设地址自增 */
    .Init.Priority = USART6_DMA_TX_PRIORITY /* DMA优先级 */
};
static uart_tx_buf_t usart6_tx_buf;

/**
 * @brief 串口6发送中断句柄
 *
 */
void DMA2_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart6_dmatx_handle);
}
#endif /* USART6_USE_DMA_TX == 1 */

#if (USART6_USE_DMA_RX == 1)
static DMA_HandleTypeDef usart6_dmarx_handle = {
    .Instance = DMA2_Stream1,
    .Init.Channel = DMA_CHANNEL_5,
    .Init.Direction = DMA_PERIPH_TO_MEMORY,       /* 接收, 外设到内存 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_CIRCULAR,                    /* 循环模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,     /* 关闭外设地址自增 */
    .Init.Priority = USART6_DMA_RX_PRIORITY /* DMA优先级 */
};
static uart_rx_fifo_t usart6_rx_fifo;

/**
 * @brief 串口6接收中断句柄
 *
 */
void DMA2_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&usart6_dmarx_handle);
}
#endif /* USART6_USE_DMA_RX == 1 */

#endif /* USART6_ENABLE == 1 */

#if (UART7_ENABLE == 1)

#if (UART7_USE_DMA_TX == 1)
static DMA_HandleTypeDef uart7_dmatx_handle = {
    .Instance = DMA1_Stream1,
    .Init.Channel = DMA_CHANNEL_5,
    .Init.Direction = DMA_MEMORY_TO_PERIPH,       /* 发送, 内存到外设 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_NORMAL,                      /* 正常模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,    /* 关闭外设地址自增 */
    .Init.Priority = UART7_DMA_TX_PRIORITY /* DMA优先级 */
};
static uart_tx_buf_t uart7_tx_buf;

/**
 * @brief 串口7发送中断句柄
 *
 */
void DMA1_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart7_dmatx_handle);
}
#endif /* UART7_USE_DMA_TX == 1 */

#if (UART7_USE_DMA_RX == 1)
static DMA_HandleTypeDef uart7_dmarx_handle = {
    .Instance = DMA1_Stream3,
    .Init.Channel = DMA_CHANNEL_5,
    .Init.Direction = DMA_PERIPH_TO_MEMORY,       /* 接收, 外设到内存 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_CIRCULAR,                    /* 循环模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,    /* 关闭外设地址自增 */
    .Init.Priority = UART7_DMA_RX_PRIORITY /* DMA优先级 */
};
