Deadline039/STM32-Template/freertos_f429/User/Bsp/Src/dma_uart.c
static uart_rx_fifo_t uart7_rx_fifo;

/**
 * @brief 串口7接收中断句柄
 *
 */
void DMA1_Stream3_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart7_dmarx_handle);
}
#endif /* UART7_USE_DMA_RX == 1 */

#endif /* UART7_ENABLE == 1 */

#if (UART8_ENABLE == 1)

#if (UART8_USE_DMA_TX == 1)
static DMA_HandleTypeDef uart8_dmatx_handle = {
    .Instance = DMA1_Stream0,
    .Init.Channel = DMA_CHANNEL_5,
    .Init.Direction = DMA_MEMORY_TO_PERIPH,       /* 发送, 内存到外设 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_NORMAL,                      /* 正常模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,    /* 关闭外设地址自增 */
    .Init.Priority = UART8_DMA_TX_PRIORITY /* DMA优先级 */
};
static uart_tx_buf_t uart8_tx_buf;

/**
 * @brief 串口8发送中断句柄
 *
 */
void DMA1_Stream0_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart8_dmatx_handle);
}
#endif /* UART8_USE_DMA_TX == 1 */

#if (UART8_USE_DMA_RX == 1)
static DMA_HandleTypeDef uart8_dmarx_handle = {
    .Instance = DMA1_Stream6,
    .Init.Channel = DMA_CHANNEL_5,
    .Init.Direction = DMA_PERIPH_TO_MEMORY,       /* 接收, 外设到内存 */
    .Init.MemDataAlignment = DMA_MDATAALIGN_BYTE, /* 内存以字节对齐 */
    .Init.MemInc = DMA_MINC_ENABLE,               /* 启用内存地址自增 */
    .Init.Mode = DMA_CIRCULAR,                    /* 循环模式 */
    .Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE, /* 外设以字节对齐 */
    .Init.PeriphInc = DMA_PINC_DISABLE,    /* 关闭外设地址自增 */
    .Init.Priority = UART8_DMA_RX_PRIORITY /* DMA优先级 */
};
static uart_rx_fifo_t uart8_rx_fifo;

/**
 * @brief 串口8接收中断句柄
 *
 */
void DMA1_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&uart8_dmarx_handle);
}
#endif /* UART8_USE_DMA_RX == 1 */

#endif /* UART8_ENABLE == 1 */

/**
 * @brief DMA发送初始化
 *
 * @param huart 串口句柄
 */
void uart_dmatx_init(UART_HandleTypeDef *huart) {
    HAL_StatusTypeDef res = HAL_OK;

    if (huart->Instance == USART1) {

#if USART1_USE_DMA_TX
        usart1_tx_buf.send_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART1_TX_BUF_SIZE);
        usart1_tx_buf.send_buf_size = USART1_TX_BUF_SIZE;
#ifdef DEBUG
        assert(usart1_tx_buf.send_buf != NULL);
#endif /* DEBUG */

        usart1_tx_buf.tc_flag = 1;

        __HAL_RCC_DMA2_CLK_ENABLE();
        res = HAL_DMA_Init(&usart1_dmatx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&usart1_handle, hdmatx, usart1_dmatx_handle);

        HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, USART1_DMA_TX_IT_PREEMPT,
                             USART1_DMA_TX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);
#endif /* USART1_USE_DMA_TX */

    } else if (huart->Instance == USART2) {

#if USART2_USE_DMA_TX
        usart2_tx_buf.send_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART2_TX_BUF_SIZE);
        usart2_tx_buf.send_buf_size = USART2_TX_BUF_SIZE;
#ifdef DEBUG
        assert(usart2_tx_buf.send_buf != NULL);
#endif /* DEBUG */

        usart2_tx_buf.tc_flag = 1;

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&usart2_dmatx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&usart2_handle, hdmatx, usart2_dmatx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, USART2_DMA_TX_IT_PREEMPT,
                             USART2_DMA_TX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);
#endif /* USART2_USE_DMA_TX */

    } else if (huart->Instance == USART3) {

#if USART3_USE_DMA_TX
        usart3_tx_buf.send_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART3_TX_BUF_SIZE);
        usart3_tx_buf.send_buf_size = USART3_TX_BUF_SIZE;
#ifdef DEBUG
        assert(usart3_tx_buf.send_buf != NULL);
#endif /* DEBUG */

        usart3_tx_buf.tc_flag = 1;

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&usart3_dmatx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&usart3_handle, hdmatx, usart3_dmatx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, USART3_DMA_TX_IT_PREEMPT,
                             USART3_DMA_TX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
#endif /* USART3_USE_DMA_TX */

    } else if (huart->Instance == UART4) {

#if UART4_USE_DMA_TX
        uart4_tx_buf.send_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART4_TX_BUF_SIZE);
        uart4_tx_buf.send_buf_size = UART4_TX_BUF_SIZE;
#ifdef DEBUG
        assert(uart4_tx_buf.send_buf != NULL);
#endif /* DEBUG */

        uart4_tx_buf.tc_flag = 1;

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&uart4_dmatx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&uart4_handle, hdmatx, uart4_dmatx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, UART4_DMA_TX_IT_PREEMPT,
                             UART4_DMA_TX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
#endif /* UART4_USE_DMA_TX */
    } else if (huart->Instance == UART5) {

#if UART5_USE_DMA_TX
        uart5_tx_buf.send_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART5_TX_BUF_SIZE);
        uart5_tx_buf.send_buf_size = UART5_TX_BUF_SIZE;
#ifdef DEBUG
        assert(uart5_tx_buf.send_buf != NULL);
#endif /* DEBUG */

        uart5_tx_buf.tc_flag = 1;

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&uart5_dmatx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&uart5_handle, hdmatx, uart5_dmatx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, UART5_DMA_TX_IT_PREEMPT,
                             UART5_DMA_TX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);
#endif /* UART5_USE_DMA_TX */

    } else if (huart->Instance == USART6) {

