Deadline039/STM32-Template/freertos_f429/User/Bsp/Src/dma_uart.c
#if USART6_USE_DMA_TX
        usart6_tx_buf.send_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART6_TX_BUF_SIZE);
        usart6_tx_buf.send_buf_size = USART6_TX_BUF_SIZE;
#ifdef DEBUG
        assert(usart6_tx_buf.send_buf != NULL);
#endif /* DEBUG */

        usart6_tx_buf.tc_flag = 1;

        __HAL_RCC_DMA2_CLK_ENABLE();
        res = HAL_DMA_Init(&usart6_dmatx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&usart6_handle, hdmatx, usart6_dmatx_handle);

        HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, USART6_DMA_TX_IT_PREEMPT,
                             USART6_DMA_TX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);
#endif /* USART6_USE_DMA_TX */

    } else if (huart->Instance == UART7) {

#if UART7_USE_DMA_TX
        uart7_tx_buf.send_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART7_TX_BUF_SIZE);
        uart7_tx_buf.send_buf_size = UART7_TX_BUF_SIZE;
#ifdef DEBUG
        assert(uart7_tx_buf.send_buf != NULL);
#endif /* DEBUG */

        uart7_tx_buf.tc_flag = 1;

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&uart7_dmatx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&uart7_handle, hdmatx, uart7_dmatx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, UART7_DMA_TX_IT_PREEMPT,
                             UART7_DMA_TX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
#endif /* UART7_USE_DMA_TX */

    } else if (huart->Instance == UART8) {

#if UART8_USE_DMA_TX
        uart8_tx_buf.send_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART8_TX_BUF_SIZE);
        uart8_tx_buf.send_buf_size = UART8_TX_BUF_SIZE;
#ifdef DEBUG
        assert(uart8_tx_buf.send_buf != NULL);
#endif /* DEBUG */

        uart8_tx_buf.tc_flag = 1;

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&uart8_dmatx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&uart8_handle, hdmatx, uart8_dmatx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, UART8_DMA_TX_IT_PREEMPT,
                             UART8_DMA_TX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
#endif /* UART8_USE_DMA_TX */
    }

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    if (huart->hdmatx != NULL) {
        /* 注册发送完成回调函数 */
        HAL_UART_RegisterCallback(huart, HAL_UART_TX_COMPLETE_CB_ID,
                                  uart_dmatx_clear_tc_flag);
    }
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief DMA接收初始化
 *
 * @param huart 串口句柄
 */
void uart_dmarx_init(UART_HandleTypeDef *huart) {
    HAL_StatusTypeDef res = HAL_OK;

    if (huart->Instance == USART1) {

#if USART1_USE_DMA_RX
        usart1_rx_fifo.head_ptr = 0;
        usart1_rx_fifo.recv_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART1_RX_BUF_SIZE);
#ifdef DEBUG
        assert(usart1_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */
        usart1_rx_fifo.rx_fifo_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART1_RX_FIFO_SZIE);
#ifdef DEBUG
        assert(usart1_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

        usart1_rx_fifo.rx_fifo = ring_fifo_init(
            usart1_rx_fifo.rx_fifo_buf, sizeof(uint8_t) * USART1_RX_FIFO_SZIE,
            RF_TYPE_STREAM);
#ifdef DEBUG
        assert(usart1_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

        __HAL_RCC_DMA2_CLK_ENABLE();
        res = HAL_DMA_Init(&usart1_dmarx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&usart1_handle, hdmarx, usart1_dmarx_handle);

        HAL_NVIC_SetPriority(DMA2_Stream5_IRQn, USART1_DMA_RX_IT_PREEMPT,
                             USART1_DMA_RX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);

#if USART1_USE_IDLE_IT
        __HAL_UART_ENABLE_IT(&usart1_handle, UART_IT_IDLE);
        __HAL_UART_CLEAR_IDLEFLAG(&usart1_handle);
#endif /* USART1_USE_IDLE_IT */
        HAL_UART_Receive_DMA(&usart1_handle, (uint8_t *)usart1_rx_fifo.recv_buf,
                             USART1_RX_BUF_SIZE);
#endif /* USART1_USE_DMA_RX */

    } else if (huart->Instance == USART2) {

#if USART2_USE_DMA_RX
        usart2_rx_fifo.head_ptr = 0;
        usart2_rx_fifo.recv_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART2_RX_BUF_SIZE);
#ifdef DEBUG
        assert(usart2_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

        usart2_rx_fifo.rx_fifo_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART2_RX_FIFO_SZIE);
#ifdef DEBUG
        assert(usart2_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

        usart2_rx_fifo.rx_fifo = ring_fifo_init(
            usart2_rx_fifo.rx_fifo_buf, sizeof(uint8_t) * USART2_RX_FIFO_SZIE,
            RF_TYPE_STREAM);
#ifdef DEBUG
        assert(usart2_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&usart2_dmarx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&usart2_handle, hdmarx, usart2_dmarx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, USART2_DMA_RX_IT_PREEMPT,
                             USART2_DMA_RX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);

#if USART2_USE_IDLE_IT
        __HAL_UART_ENABLE_IT(&usart2_handle, UART_IT_IDLE);
        __HAL_UART_CLEAR_IDLEFLAG(&usart2_handle);
#endif /* USART2_USE_IDLE_IT */
        HAL_UART_Receive_DMA(&usart2_handle, (uint8_t *)usart2_rx_fifo.recv_buf,
                             USART2_RX_BUF_SIZE);
#endif /* USART2_USE_DMA_RX */

    } else if (huart->Instance == USART3) {

#if USART3_USE_DMA_RX
        usart3_rx_fifo.head_ptr = 0;
        usart3_rx_fifo.recv_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART3_RX_BUF_SIZE);
#ifdef DEBUG
        assert(usart3_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

        usart3_rx_fifo.rx_fifo_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART3_RX_FIFO_SZIE);
#ifdef DEBUG
        assert(usart3_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

        usart3_rx_fifo.rx_fifo = ring_fifo_init(
            usart3_rx_fifo.rx_fifo_buf, sizeof(uint8_t) * USART3_RX_FIFO_SZIE,
            RF_TYPE_STREAM);
#ifdef DEBUG
        assert(usart3_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

