Deadline039/STM32-Template/freertos_f429/User/Bsp/Src/dma_uart.c
        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&usart3_dmarx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&usart3_handle, hdmarx, usart3_dmarx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, USART3_DMA_RX_IT_PREEMPT,
                             USART3_DMA_RX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);

#if USART3_USE_IDLE_IT
        __HAL_UART_ENABLE_IT(&usart3_handle, UART_IT_IDLE);
        __HAL_UART_CLEAR_IDLEFLAG(&usart3_handle);
#endif /* USART3_USE_IDLE_IT */
        HAL_UART_Receive_DMA(&usart3_handle, (uint8_t *)usart3_rx_fifo.recv_buf,
                             USART3_RX_BUF_SIZE);
#endif /* USART3_USE_DMA_RX */

    } else if (huart->Instance == UART4) {

#if UART4_USE_DMA_RX
        uart4_rx_fifo.head_ptr = 0;
        uart4_rx_fifo.recv_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART4_RX_BUF_SIZE);
#ifdef DEBUG
        assert(uart4_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

        uart4_rx_fifo.rx_fifo_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART4_RX_FIFO_SZIE);
#ifdef DEBUG
        assert(uart4_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

        uart4_rx_fifo.rx_fifo = ring_fifo_init(
            uart4_rx_fifo.rx_fifo_buf, sizeof(uint8_t) * UART4_RX_FIFO_SZIE,
            RF_TYPE_STREAM);
#ifdef DEBUG
        assert(uart4_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&uart4_dmarx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&uart4_handle, hdmarx, uart4_dmarx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, UART4_DMA_RX_IT_PREEMPT,
                             UART4_DMA_RX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);

#if UART4_USE_IDLE_IT
        __HAL_UART_ENABLE_IT(&uart4_handle, UART_IT_IDLE);
        __HAL_UART_CLEAR_IDLEFLAG(&uart4_handle);
#endif /* UART4_USE_IDLE_IT */
        HAL_UART_Receive_DMA(&uart4_handle, (uint8_t *)uart4_rx_fifo.recv_buf,
                             UART4_RX_BUF_SIZE);
#endif /* UART4_USE_DMA_RX */
    } else if (huart->Instance == UART5) {

#if UART5_USE_DMA_RX
        uart5_rx_fifo.head_ptr = 0;
        uart5_rx_fifo.recv_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART5_RX_BUF_SIZE);
#ifdef DEBUG
        assert(uart5_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

        uart5_rx_fifo.rx_fifo_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART5_RX_FIFO_SZIE);
#ifdef DEBUG
        assert(uart5_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

        uart5_rx_fifo.rx_fifo = ring_fifo_init(
            uart5_rx_fifo.rx_fifo_buf, sizeof(uint8_t) * UART5_RX_FIFO_SZIE,
            RF_TYPE_STREAM);
#ifdef DEBUG
        assert(uart5_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&uart5_dmarx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&uart5_handle, hdmarx, uart5_dmarx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, UART5_DMA_RX_IT_PREEMPT,
                             UART5_DMA_RX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);

#if UART5_USE_IDLE_IT
        __HAL_UART_ENABLE_IT(&uart5_handle, UART_IT_IDLE);
        __HAL_UART_CLEAR_IDLEFLAG(&uart5_handle);
#endif /* UART5_USE_IDLE_IT */
        HAL_UART_Receive_DMA(&uart5_handle, (uint8_t *)uart5_rx_fifo.recv_buf,
                             UART5_RX_BUF_SIZE);
#endif /* UART5_USE_DMA_RX */
    } else if (huart->Instance == USART6) {

#if USART6_USE_DMA_RX
        usart6_rx_fifo.head_ptr = 0;
        usart6_rx_fifo.recv_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART6_RX_BUF_SIZE);
#ifdef DEBUG
        assert(usart6_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

        usart6_rx_fifo.rx_fifo_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * USART6_RX_FIFO_SZIE);
#ifdef DEBUG
        assert(usart6_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

        usart6_rx_fifo.rx_fifo = ring_fifo_init(
            usart6_rx_fifo.rx_fifo_buf, sizeof(uint8_t) * USART6_RX_FIFO_SZIE,
            RF_TYPE_STREAM);
#ifdef DEBUG
        assert(usart6_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

        __HAL_RCC_DMA2_CLK_ENABLE();
        res = HAL_DMA_Init(&usart6_dmarx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&usart6_handle, hdmarx, usart6_dmarx_handle);

        HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, USART6_DMA_RX_IT_PREEMPT,
                             USART6_DMA_RX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

#if USART6_USE_IDLE_IT
        __HAL_UART_ENABLE_IT(&usart6_handle, UART_IT_IDLE);
        __HAL_UART_CLEAR_IDLEFLAG(&usart6_handle);
#endif /* USART6_USE_IDLE_IT */
        HAL_UART_Receive_DMA(&usart6_handle, (uint8_t *)usart6_rx_fifo.recv_buf,
                             USART6_RX_BUF_SIZE);
#endif /* USART6_USE_DMA_RX */
    } else if (huart->Instance == UART7) {

#if UART7_USE_DMA_RX
        uart7_rx_fifo.head_ptr = 0;
        uart7_rx_fifo.recv_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART7_RX_BUF_SIZE);
#ifdef DEBUG
        assert(uart7_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

        uart7_rx_fifo.rx_fifo_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART7_RX_FIFO_SZIE);
#ifdef DEBUG
        assert(uart7_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

        uart7_rx_fifo.rx_fifo = ring_fifo_init(
            uart7_rx_fifo.rx_fifo_buf, sizeof(uint8_t) * UART7_RX_FIFO_SZIE,
            RF_TYPE_STREAM);
#ifdef DEBUG
        assert(uart7_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&uart7_dmarx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&uart7_handle, hdmarx, uart7_dmarx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, UART7_DMA_RX_IT_PREEMPT,
                             UART7_DMA_RX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

#if UART7_USE_IDLE_IT
        __HAL_UART_ENABLE_IT(&uart7_handle, UART_IT_IDLE);
        __HAL_UART_CLEAR_IDLEFLAG(&uart7_handle);
#endif /* UART7_USE_IDLE_IT */
        HAL_UART_Receive_DMA(&uart7_handle, (uint8_t *)uart7_rx_fifo.recv_buf,
                             UART7_RX_BUF_SIZE);
#endif /* UART7_USE_DMA_RX */
    } else if (huart->Instance == UART8) {

#if UART8_USE_DMA_RX
        uart8_rx_fifo.head_ptr = 0;
        uart8_rx_fifo.recv_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART8_RX_BUF_SIZE);
#ifdef DEBUG
        assert(uart8_rx_fifo.recv_buf != NULL);
#endif /* DEBUG */

        uart8_rx_fifo.rx_fifo_buf =
            (uint8_t *)malloc(sizeof(uint8_t) * UART8_RX_FIFO_SZIE);
#ifdef DEBUG
        assert(uart8_rx_fifo.rx_fifo_buf != NULL);
#endif /* DEBUG */

        uart8_rx_fifo.rx_fifo = ring_fifo_init(
            uart8_rx_fifo.rx_fifo_buf, sizeof(uint8_t) * UART8_RX_FIFO_SZIE,
            RF_TYPE_STREAM);
#ifdef DEBUG
        assert(uart8_rx_fifo.rx_fifo != NULL);
#endif /* DEBUG */

