Deadline039/STM32-Template/freertos_f429/User/Bsp/Src/dma_uart.c
        __HAL_RCC_DMA1_CLK_ENABLE();
        res = HAL_DMA_Init(&uart8_dmarx_handle);
#ifdef DEBUG
        assert(res == HAL_OK);
#endif /* DEBUG */

        __HAL_LINKDMA(&uart8_handle, hdmarx, uart8_dmarx_handle);

        HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, UART8_DMA_RX_IT_PREEMPT,
                             UART8_DMA_RX_IT_SUB);
        HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);

#if UART8_USE_IDLE_IT
        __HAL_UART_ENABLE_IT(&uart8_handle, UART_IT_IDLE);
        __HAL_UART_CLEAR_IDLEFLAG(&uart8_handle);
#endif /* UART8_USE_IDLE_IT */
        HAL_UART_Receive_DMA(&uart8_handle, (uint8_t *)uart8_rx_fifo.recv_buf,
                             UART8_RX_BUF_SIZE);
#endif /* UART8_USE_DMA_RX */
    }

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
    if (huart->hdmarx != NULL) {
        /* 注册半满, 全满回调函数 */
        HAL_UART_RegisterCallback(huart, HAL_UART_RX_HALFCOMPLETE_CB_ID,
                                  uart_dmarx_halfdone_callback);
        HAL_UART_RegisterCallback(huart, HAL_UART_RX_COMPLETE_CB_ID,
                                  uart_dmarx_done_callback);
    }
#endif /* USE_HAL_UART_REGISTER_CALLBACKS == 1 */
}

/**
 * @brief 根据串口句柄, 判断是哪个发送缓冲区指针
 *
 * @param huart 串口句柄
 * @return 发送缓冲区指针
 */
static inline uart_tx_buf_t *uart_tx_identify(UART_HandleTypeDef *huart) {
    if (huart->Instance == USART1) {
#if USART1_USE_DMA_TX
        return &usart1_tx_buf;
#endif /* USART1_USE_DMA_TX */
    } else if (huart->Instance == USART2) {
#if USART2_USE_DMA_TX
        return &usart2_tx_buf;
#endif /* USART2_USE_DMA_TX */
    } else if (huart->Instance == USART3) {
#if USART3_USE_DMA_TX
        return &usart3_tx_buf;
#endif /* USART3_USE_DMA_TX */
    } else if (huart->Instance == UART4) {
#if UART4_USE_DMA_TX
        return &uart4_tx_buf;
#endif /* UART4_USE_DMA_TX */
    } else if (huart->Instance == UART5) {
#if UART5_USE_DMA_TX
        return &uart5_tx_buf;
#endif /* UART5_USE_DMA_TX */
    } else if (huart->Instance == USART6) {
#if USART6_USE_DMA_TX
        return &usart6_tx_buf;
#endif /* USART6_USE_DMA_TX */
    } else if (huart->Instance == UART7) {
#if UART7_USE_DMA_TX
        return &uart7_tx_buf;
#endif /* UART7_USE_DMA_TX */
    } else if (huart->Instance == UART8) {
#if UART8_USE_DMA_TX
        return &uart8_tx_buf;
#endif /* UART8_USE_DMA_TX */
    }
    return NULL;
}

/**
 * @brief 根据串口句柄, 判断是哪个接收缓冲区指针
 *
 * @param huart 串口句柄
 * @return 接收缓冲区指针
 */
static inline uart_rx_fifo_t *uart_rx_identify(UART_HandleTypeDef *huart) {
    if (huart->Instance == USART1) {
#if USART1_USE_DMA_RX
        return &usart1_rx_fifo;
#endif /* USART1_USE_DMA_RX */
    } else if (huart->Instance == USART2) {
#if USART2_USE_DMA_RX
        return &usart2_rx_fifo;
#endif /* USART2_USE_DMA_RX */
    } else if (huart->Instance == USART3) {
#if USART3_USE_DMA_RX
        return &usart3_rx_fifo;
#endif /* USART3_USE_DMA_RX */
    } else if (huart->Instance == UART4) {
#if UART4_USE_DMA_RX
        return &uart4_rx_fifo;
#endif /* UART4_USE_DMA_RX */
    } else if (huart->Instance == UART5) {
#if UART5_USE_DMA_RX
        return &uart5_rx_fifo;
#endif /* UART5_USE_DMA_RX */
    } else if (huart->Instance == USART6) {
#if USART6_USE_DMA_RX
        return &usart6_rx_fifo;
#endif /* USART6_USE_DMA_RX */
    } else if (huart->Instance == UART7) {
#if UART7_USE_DMA_RX
        return &uart7_rx_fifo;
#endif /* UART7_USE_DMA_RX */
    } else if (huart->Instance == UART8) {
#if UART8_USE_DMA_RX
        return &uart8_rx_fifo;
#endif /* UART8_USE_DMA_RX */
    }
    return NULL;
}

/*****************************************************************************
 * @defgroup 发送函数部分
 * @{
 */

/**
 * @brief 清楚串口发送完成标志位
 *
 * @param huart 串口句柄
 */
void uart_dmatx_clear_tc_flag(UART_HandleTypeDef *huart) {
    uart_tx_buf_t *uart_tx_buf = uart_tx_identify(huart);
    if (uart_tx_buf == NULL) {
        return;
    }

    uart_tx_buf->tc_flag = 1;
}

/**
 * @brief 向串口发送缓冲区中写入数据
 *
 * @param huart 串口句柄
 * @param data 数据
 * @param len 数据长度
 * @return 成功写入的长度
 */
uint32_t uart_dmatx_write(UART_HandleTypeDef *huart, const void *data,
                          size_t len) {
    if ((data == NULL) || (len == 0)) {
        return 0;
    }

    uart_tx_buf_t *send_tx_buf = uart_tx_identify(huart);
    if (send_tx_buf == NULL) {
        return 0;
    }

    /* 计算当前缓冲区剩余长度 */
    uint32_t buf_remain = send_tx_buf->send_buf_size - send_tx_buf->head_ptr;

    /* 如果要写入的长度大于剩余长度, 为避免溢出, 只写入剩余的长度 */
    if (buf_remain < len) {
        memcpy(send_tx_buf->send_buf + send_tx_buf->head_ptr, data, buf_remain);
        send_tx_buf->head_ptr += buf_remain;
        return buf_remain;
    } else {
        memcpy(send_tx_buf->send_buf + send_tx_buf->head_ptr, data, len);
        send_tx_buf->head_ptr += len;
        return len;
    }
}

/**
 * @brief 把FIFO中的数据通过DMA发送
 *
 * @param huart 串口句柄
 * @return 成功发送的长度
 * @note 先使用`uart_dmatx_write`写入数据
 */
uint32_t uart_dmatx_send(UART_HandleTypeDef *huart) {
    uart_tx_buf_t *send_tx_buf = uart_tx_identify(huart);
    if (send_tx_buf == NULL) {
        return 0;
    }

    /* 未启用DMA */
    if (huart->hdmatx == NULL) {
        return 0;
    }

    /* 未发送完毕 */
    if (!send_tx_buf->tc_flag) {
        return 0;
    }

    uint32_t len = send_tx_buf->head_ptr;
    /* 缓冲区为空 */
    if (!len) {
        return 0;
    }

    send_tx_buf->tc_flag = 0;
    HAL_UART_Transmit_DMA(huart, send_tx_buf->send_buf, (uint16_t)len);
    send_tx_buf->head_ptr = 0;
    return len;
}

/**
 * @}
 */

/*****************************************************************************
 * @defgroup 接收函数部分
 * @{
 */

/**
 * @brief 向接收FIFO写数据
 *
 * @param uart_rx_fifo 串口接收缓冲区
 * @param data 要写入的数据
 * @param len 数据长度
 */
static inline void uart_write_rx_fifo(uart_rx_fifo_t *uart_rx_fifo,
                                      const void *data, uint32_t len) {
    if ((data == NULL) || (len == 0)) {
        return;
    }

    uint32_t copied = ring_fifo_write(uart_rx_fifo->rx_fifo, data, len);
    if (copied != len) {
        // printf("%s is full. \r\n", __FUNCTION__);
    }
}

/**
 * @brief DMA接收空闲回调
 *
 * @param huart 串口句柄
 */
void uart_dmarx_idle_callback(UART_HandleTypeDef *huart) {
    uart_rx_fifo_t *uart_rx_fifo = uart_rx_identify(huart);
    if (uart_rx_fifo == NULL) {
        return;
    }

